#List (სია) არის კონტეინერი (ელემენტი), რომელსაც შეგვიძლია შევუყვანოთ რამდენიმე რამ ერთ დროს / ანუ აერთიანებს რამოდენიმე 
# ტიპს. სიას ვქმნით შემდეგნაირად names, ages, რომელიც ვლახდება და წერია [] -ში. 
# ეს სია მისთვის მსგავს ფუნქციას ავლენს. ages = [12, 12, 13, 15, 16 ] / 
# სიას შეუძლია შევიყვანოთ განსხვავებული მონაცემი როგორც string, int, float, boolean.

# როგორ გამოვიყენოთ სიის ელემენტები? სიის გამოვიყენებ ელემენტი ინექსირებით 
#ames = ["დათო", "გიორგი", "მარინა"]
#print(names[2])

# რა არის ინდექსირება? ინდექსირება ნიშნავს იმას, რომ სიის ნომრებს საშუალებას გვაძლევს სიის 
# ნუმერაციის რაოდენობის იმ ადგილას მივწვდეთ სადაც ნულიდან იწყება. 0-დან არის სიის დაწყება
# ინდექსირება იწყება და 0-დან ხდება თითოეულზე მიმართვა.


 
numbers =[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12,13, 14, 15, 16, 17, 18, 19, 20]

print(numbers[0])
print(numbers[1])
print(numbers[2])
print(numbers[3])
print(numbers[4])
print(numbers[5])
print(numbers[6])
print(numbers[7])
print(numbers[8])
print(numbers[9])
print(numbers[10])
print(numbers[11])
print(numbers[12])
print(numbers[13])
print(numbers[14])
print(numbers[15])
print(numbers[16])
print(numbers[17])
print(numbers[18])
print(numbers[19])



ჩემი_სია = [1, 2, 3, 4, 5]

ჩემი_სია[0] = "ა"
ჩემი_სია[1] = "ბ"
ჩემი_სია[2] = "გ"
ჩემი_სია[3] = "დ"
ჩემი_სია[4] = "ე"

print(ჩემი_სია)